//#include <iostream>
//using namespace std;
//
//int a1[100], n1, ans1 = 0;
//int c1[100], c2[100], c3[100]; //判断这个点的正上方、左对角、右对角有没有皇后
////是否在同一列看竖坐标是否相等
////是否在同一左斜线看横坐标 + 竖坐标是否相等
////是否在同一右斜线看(横坐标 - 竖坐标 + 15)是否相等(由于可能为负数，所以加上15)
//void p1219(int x)
//{
//    if (x > n1) {
//        ans1++;
//        if (ans1 <= 3) {
//            for (int i = 1; i <= n1; i++)
//                cout << a1[i] << " ";
//            cout << endl;
//        }
//    }
//    for (int i = 1; i <= n1; i++) {
//        if (c1[i] == 0 && c2[i + (n1 - x + 1)] == 0 && c3[i - (n1 - x + 1) + 15] == 0) {
//            c1[i] = 1, c2[i + (n1 - x + 1)] = 1, c3[i - (n1 - x + 1) + 15] = 1;
//            a1[x] = i;
//            p1219(x + 1);
//            c1[i] = 0, c2[i + (n1 - x + 1)] = 0, c3[i - (n1 - x + 1) + 15] = 0;
//            a1[x] = 0;
//        }
//    }
//}
//
//int main()
//{
//    cin >> n1;
//    p1219(1);
//    cout << ans1 << endl;
//    system("pause");
//    return 0;
//}